// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "Scannen an Computer";

// Restore alert message
"RESTORE_TITLE" = "Die Einstellungen wirklich wiederherstellen?";
"RESTORE_MSG" = "Wenn Sie fortfahren, werden alle Scan-Shortcuts auf ihren urprünglichen Status zurückgesetzt. Drücken Sie “Abbrechen”, um die Shortcuts nicht zu ändern, oder “Wiederherstellen”, um die Shortcuts auf die Werkseinstellungen zurückzusetzen.";
"RESTORE_BUTTON_TITLE" = "Wiederherstellen";

"DEFAULT_TASK_CAPTION" = "Aufgabenname:";
"DONE" = "Fertig";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "Aufgabe nicht verfügbar";
"TASK_NOT_FOUND_DESC" = "Die auf Ihrem Gerät gefundene Aufgabe “%@” ist nicht auf Ihrem System verfügbar. Wählen Sie eine andere Aufgabe aus.";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Fehler bei Arbeitsablaufkopie";
"COPY_WORKFLOWS_DESC" = "Fehler beim Kopieren der Arbeitsabläufe in den Domänenordner des Benutzergeräts";

"DEVICE_NOT_FOUND_TITLE" = "Gerät nicht gefunden";
"DEVICE_NOT_FOUND_DESC" = "Problem beim Kommunizieren mit dem Gerät. Vergewissern Sie sich, dass das Gerät eingeschaltet und korrekt verbunden ist. Versuchen Sie es dann erneut.";

"COMPUTER_NAME_INFO_TITLE" = "Das Feld “Computername” dient zum Eingeben des Namens des Computers, der auf dem HP Gerät angezeigt wird."; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "Die mögliche Zeichenanzahl variiert je nach Gerät.";

"UNKNOWN_ERROR_TITLE" = "Unbekannter Fehler";
"UNKNOWN_ERROR_DESC" = "Unbekannter Fehler beim Aktualisieren des Geräts. Vergewissern Sie sich, dass das Gerät eingeschaltet und korrekt verbunden ist.";

"OK" = "OK";
"CANCEL" = "Abbrechen";

"MOREINFO_TITLE" = "Weitere Informationen";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "Manager für Scan-Shortcuts"; // Title
"SSM_SHORT_DESC" = "Scan-Shortcuts dienen zum Ausführen häufiger Scanaufgaben mithilfe der Bedienelemente auf dem Bedienfeld des HP Geräts."; // short description
"YOUR_COMPUTER_NAME" = "Name des Computers:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "Ändern...";
"MORE_INFO_BTN_TITLE" = "Weitere Informationen...";
"RESTORE_BTN_TITLE" = "Standard wiederherstellen";
"TEST_BTN_TITLE" = "Testen...";
"EDIT_BTN_TITLE" = "Bearbeiten...";

// Error Messages
"ERROR_PERMISSION_DENIED" = "Sie besitzen nicht die erforderlichen Zugriffsrechte für den Ordner “%@”. Wählen Sie zum Anzeigen und Ändern der Zugriffsrechte die Komponente im Finder und dann “Ablage > Informationen” aus."; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "Fehler";
"ERROR_UNKNOWN_DESC" = "Unbekannter Fehler.";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "Shortcut nicht gefunden";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "Der Shortcut %1$@ für das Gerät %2$@ konnte nicht gefunden werden. Installieren Sie die Software erneut.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Fehler beim Erstellen des Arbeitsablaufs";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "Unbekannter Fehler beim Erstellen des Arbeitsablaufs. Versuchen Sie es erneut.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Fehler beim Erstellen des Verzeichnisses";
"ERROR_CREATING_DIR_DESC" = "Fehler beim Erstellen des Verzeichnisses %@. Überprüfen Sie die Zugriffsrechte für den übergeordneten Ordner, und versuchen Sie es dann erneut.";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "Fehler beim Öffnen des Arbeitsablaufs “%@” in Automator. Der Arbeitsablauf konnte nicht an seiner ursprünglichen Position gefunden werden.";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Scan-Shortcut wird nicht unterstützt";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "Der ausgewählte Scan-Shortcut ist nicht ausführbar, da er von der Software nicht erkannt wird. Wählen Sie einen anderen Scan-Shortcut aus, und versuchen Sie es erneut.";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "Klicken, um den Computernamen zu ändern";
"TIP_FOR_EDIT_BTN" = "Ausgewählte Aufgabe bearbeiten";
"TIP_FOR_TEST_BTN" = "Ausgewählte Aufgabe ausführen";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "Der Computername lautet";
"COMPUTER_NAME_DESCRIPTION" = "Beim Starten eines Scanvorgangs von Ihrem HP Gerät aus werden Sie ggf. aufgefordert, den Computer in einer Liste mit für „Scannen an Computer“ aktivierten Hostcomputern auszuwählen.";
"COMPUTER" = "Computer";
"COMPUTERS" = "Computer";


"COMMUNICATION_ERROR" = "Kommunikation mit Scanner kann nicht hergestellt werden. Vergewissern Sie sich, dass das Gerät eingeschaltet ist, prüfen Sie die Verbindung, und stellen Sie sicher, dass das Netzwerk korrekt funktioniert. Auf dem Gerät muss Bonjour aktiviert sein.";
"INSTALLATION_ERROR" = "Die HP Software, die zum Scannen an den Computer erforderlich ist, konnte nicht auf dem Computer gefunden werden. Laden Sie die neueste empfohlene HP Software für Ihr Gerät unter http://www.hp.com/support herunter, und installieren Sie diese. Versuchen Sie es dann erneut.";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "„Scannen an Computer“ ist nicht aktivierbar";
"SCAN_TO_COMPUTER_DESCRIPTION" = "Mithilfe von „Scannen an Computer“ können Sie Scanvorgänge über das Bedienfeld des HP Geräts starten, wobei die Ausgabe automatisch an den Computer gesendet wird.";

HSDScanActionNotFoundTitle = "Scanaktion kann nicht gefunden werden";
HSDScanActionNotFoundDescription = "Scanaktion nicht registriert. Starten Sie die Anwendung HP Scan unter '%@', um die Scanaktion automatisch registrieren zu lassen.";
